quangnd159/srs-box/firmware/sdkconfig.defaults
# DB MEGA3D 3ST: ESP32-S3 N16R8 (16MB quad flash, 8MB octal PSRAM)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Console on the native USB peripheral, same cable as flashing.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_CXX_EXCEPTIONS=n

# LVGL (configured through Kconfig when built as an IDF component)
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_DEF_REFR_PERIOD=16

# @shot needs lv_snapshot_take(), and the ~135KB it allocates for a 240x284
# RGB565 frame is far bigger than LVGL's small built-in pool
# (CONFIG_LV_MEM_SIZE_KILOBYTES, 64KB). Route lv_malloc() through the C
# library malloc instead: with CONFIG_SPIRAM_USE_MALLOC=y (above), the IDF
# heap allocator already spills large allocations into PSRAM automatically,
# so this is enough to make room without any LVGL-side pool size to tune.
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_SNAPSHOT=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
